Web Apps with Spyre
---

In [1]:
import sqlite3 as lite
import pandas as pd
con = lite.connect('nbs.db')
artists_query = "select id, name from artists"
artists_df = pd.read_sql(artists_query, con)

socail_query = "select * from social_data"
social_df = pd.read_sql(socail_query, con)
artists_df.head()

    id                 name
0  500           The Scenic
1  710      Our Family Name
2  744            Khamelien
3  786    Death in the Park
4  818  enter the collector

In [2]:
social_df.head()

,artist_id,FaceBookPageLikes,TwitterFollowers,YouTubeViews,InstagramLikes,InstagramFollowers
0,500,4797.0,1395.0,NaN,NaN,NaN
1,744,NaN,224.0,44287.0,NaN,NaN
2,952,4142.0,64.0,130279.0,NaN,NaN
3,1017,NaN,NaN,2966.0,NaN,NaN
4,1086,28980.0,43405.0,402054.0,56832.0,7653.0

In [3]:
df_merged = pd.merge(artists_df, social_df, left_on='id', right_on='artist_id')
df_merged.head()

,id,name,artist_id,FaceBookPageLikes,TwitterFollowers,YouTubeViews,InstagramLikes,InstagramFollowers
0,500,The Scenic,500,4797.0,1395.0,NaN,NaN,NaN
1,744,Khamelien,744,NaN,224.0,44287.0,NaN,NaN
2,952,Shorelines End,952,4142.0,64.0,130279.0,NaN,NaN
3,1017,Hollywood Ave,1017,NaN,NaN,2966.0,NaN,NaN
4,1086,Play for keeps,1086,28980.0,43405.0,402054.0,56832.0,7653.0

In [4]:
import sqlite3 as lite
import pandas as pd

def get_social_data():
    con = lite.connect('nbs.db')
    artists_query = "select id, name from artists"
    artists_df = pd.read_sql(artists_query, con)

    socail_query = "select * from social_data"
    social_df = pd.read_sql(socail_query, con)
    df_merged = pd.merge(artists_df, social_df, left_on='id', right_on='artist_id')
    return df_merged.drop(['id', 'artist_id'], axis=1)

In [5]:
def top_artists(network, n=10):
    """return the top n artists from network"""
    df_social = get_social_data()  # get the data from sql
    
    # sort the result by the given network in descending order
    df_sorted = df_social.sort_values(by=network, ascending=False)
    
    # limit the results to the top n artists
    df_limited = df_sorted.head(n).copy()
    
    # convert the values to integers so they look nicer
    df_limited.loc[:, network] = df_limited.loc[:, network].astype('int')
    
    # return the results but just include the values for the network of interest
    return df_limited.loc[:, ['name', network]]

top_artists('TwitterFollowers', n=7)

                   name  TwitterFollowers
1881    The Amp Jackers             97933
1049           DaveRose             95106
2043          Dez Duron             89117
649         Pauly Shore             84642
1525  Doyin aka Lyrical             80197
3571      Chantelle Lee             78375
3425           Billi. B             71055